# todo: Определить в коде  переменные:

# 1. Целочисленного типа (integer)
# 2. Вещественного типа (float)
# 3. Логического типа (bool)
# 4. Строкового типа (string)
# 5. Пустого типа (none)

# Вывести все их типы.
num1 = 10
print(type(num1))
num2 = 10.123
print(type(num2))
num3 = True
print(type(num3))
num4 = 'number 4'
print(type(num4))
num5 = None
print(type(num5))
